# Check Sales Forecast

In [23]:
import pandas as pd 
import numpy as np

In [24]:
checks_df= pd.read_csv("Downloads/check_list_2021.csv")

In [25]:
checks_df.head()

,**********************,NO CHEQUE,BANCO,MONTO,COMICION,TOTAL,DIA CAMBIO,NO TEL,ID CLIENTE,N. DE EMPRESA,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16
0,DANIEL E AGUIRRE,1068.0,UNION BANK,"$1,359.47",$21.07,"$1,338.40",5/14/2019,0,NaN,CALIFORNIA BURRITO,NaN,CAMBIARIO 1,FECHA:,01/01/2021,NaN,NaN,NaN
1,CLAUDIO CALONA,30597.0,WELLS FARGO BANK,"$1,138.19",$17.64,"$1,120.55",5/14/2019,0,NaN,STONE TILE EVOLUTION LLC,NaN,SUB TOTAL,COM,T SIN COM,NaN,NaN,NaN
2,ENRIQUE OROSCO DIAZ,3064.0,EL DORADO SAVINGS BANK,$895.34,$13.88,$881.46,5/14/2019,0,NaN,SB MARTIN LLC,NaN,NaN,$ -,$ -,NaN,NaN,NaN
3,CESAR ORTIZ RANGEL,10101647.0,CALIFORNIA BANK,$356.34,$5.52,$350.82,5/14/2019,0,NaN,HORIZON,NaN,,NaN,NaN,NaN,NaN,NaN
4,CESAR ORTIZ RANGEL,10094421.0,CALIFORNIA BANK,$607.95,$9.42,$598.53,5/15/2019,0,NaN,HORIZON,NaN,SUB TOTAL,COM,T SIN COM,NaN,NaN,NaN

In [26]:
checks_df =checks_df.drop(columns=['ID CLIENTE', 'NO TEL','Unnamed: 10',
                        'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13', 'Unnamed: 14',
                       'Unnamed: 15', 'Unnamed: 16'])

In [27]:
checks_df.head()

,**********************,NO CHEQUE,BANCO,MONTO,COMICION,TOTAL,DIA CAMBIO,N. DE EMPRESA
0,DANIEL E AGUIRRE,1068.0,UNION BANK,"$1,359.47",$21.07,"$1,338.40",5/14/2019,CALIFORNIA BURRITO
1,CLAUDIO CALONA,30597.0,WELLS FARGO BANK,"$1,138.19",$17.64,"$1,120.55",5/14/2019,STONE TILE EVOLUTION LLC
2,ENRIQUE OROSCO DIAZ,3064.0,EL DORADO SAVINGS BANK,$895.34,$13.88,$881.46,5/14/2019,SB MARTIN LLC
3,CESAR ORTIZ RANGEL,10101647.0,CALIFORNIA BANK,$356.34,$5.52,$350.82,5/14/2019,HORIZON
4,CESAR ORTIZ RANGEL,10094421.0,CALIFORNIA BANK,$607.95,$9.42,$598.53,5/15/2019,HORIZON

In [28]:
checks_df=checks_df.rename(columns={' **********************': 'client_name','NO CHEQUE': 'check_no','BANCO':'bank',
                                   'MONTO':'amount','TOTAL':'total','DIA CAMBIO':'date_cashed',
                                   'N. DE EMPRESA': 'company_name','COMICION':'commision'})

In [29]:
checks_df.check_no.value_counts()

64.0         10
1048.0        7
1451.0        6
1117.0        6
1347.0        6
             ..
6341.0        1
20752.0       1
20799.0       1
2023018.0     1
3608.0        1
Name: check_no, Length: 14849, dtype: int64

In [30]:
checks_df.head()

,client_name,check_no,bank,amount,commision,total,date_cashed,company_name
0,DANIEL E AGUIRRE,1068.0,UNION BANK,"$1,359.47",$21.07,"$1,338.40",5/14/2019,CALIFORNIA BURRITO
1,CLAUDIO CALONA,30597.0,WELLS FARGO BANK,"$1,138.19",$17.64,"$1,120.55",5/14/2019,STONE TILE EVOLUTION LLC
2,ENRIQUE OROSCO DIAZ,3064.0,EL DORADO SAVINGS BANK,$895.34,$13.88,$881.46,5/14/2019,SB MARTIN LLC
3,CESAR ORTIZ RANGEL,10101647.0,CALIFORNIA BANK,$356.34,$5.52,$350.82,5/14/2019,HORIZON
4,CESAR ORTIZ RANGEL,10094421.0,CALIFORNIA BANK,$607.95,$9.42,$598.53,5/15/2019,HORIZON

In [31]:
checks_df.columns

Index(['client_name', 'check_no', 'bank', 'amount', 'commision', 'total',
       'date_cashed', 'company_name'],
      dtype='object')

In [32]:
checks_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17999 entries, 0 to 17998
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   client_name   17093 non-null  object
 1   check_no      17093 non-null  float64
 2   bank          17093 non-null  object
 3   amount        17093 non-null  object
 4   commision     17999 non-null  object
 5   total         17999 non-null  object
 6   date_cashed   14365 non-null  object
 7   company_name  17092 non-null  object
dtypes: float64(1), object(7)
memory usage: 1.1+ MB

In [33]:
checks_df.tail()

,client_name,check_no,bank,amount,commision,total,date_cashed,company_name
17994,NaN,NaN,NaN,NaN,$0.00,$0.00,NaN,NaN
17995,NaN,NaN,NaN,NaN,$0.00,$0.00,NaN,NaN
17996,NaN,NaN,NaN,NaN,$0.00,$0.00,NaN,NaN
17997,NaN,NaN,NaN,NaN,$0.00,$0.00,NaN,NaN
17998,NaN,NaN,NaN,NaN,$0.00,$0.00,NaN,NaN

Last entries were not filled out, dropping these last entries. 
Checking only if check_no and amount have missing values, dropping these.

In [34]:
checks_df.isnull().sum()

client_name      906
check_no         906
bank             906
amount           906
commision          0
total              0
date_cashed     3634
company_name     907
dtype: int64

In [35]:
checks_updated = checks_df.dropna(subset=['check_no', 'amount','date_cashed'])
checks_updated.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14365 entries, 0 to 14365
Data columns (total 8 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   client_name   14365 non-null  object
 1   check_no      14365 non-null  float64
 2   bank          14365 non-null  object
 3   amount        14365 non-null  object
 4   commision     14365 non-null  object
 5   total         14365 non-null  object
 6   date_cashed   14365 non-null  object
 7   company_name  14364 non-null  object
dtypes: float64(1), object(7)
memory usage: 1010.0+ KB

In [36]:
checks_updated.isnull().sum()

client_name     0
check_no        0
bank            0
amount          0
commision       0
total           0
date_cashed     0
company_name    1
dtype: int64

In [37]:
checks_updated.tail()

,client_name,check_no,bank,amount,commision,total,date_cashed,company_name
14361,JUAN SARABIA,2.581330e+05,BANK OF AMERICA,$671.95,$12.10,$659.85,11/09/2021,SAMUEL HALE LLC
14362,ELDER CHOCOJ,1.031588e+09,CHASE BANK,"$1,021.07",$18.38,"$1,002.69",11/09/2021,FOUNTAINS GYRO HOUSE LLC
14363,ELDER CHOCOJ,1.031570e+09,CHASE BANK,"$1,540.02",$27.72,"$1,512.30",11/09/2021,RIDGE GYRO HOUSE
14364,LEONORA OCHOA RUIZ,5.554700e+04,PREMIER BANK,"$1,283.56",$23.10,"$1,260.46",11/09/2021,TWS RESTAURANT CORP STORE
14365,VICTOR VALADEZ,3.001287e+08,US BANK,$754.76,$13.59,$741.17,11/09/2021,AVITUS INC

In [38]:
checks_updated.head()

,client_name,check_no,bank,amount,commision,total,date_cashed,company_name
0,DANIEL E AGUIRRE,1068.0,UNION BANK,"$1,359.47",$21.07,"$1,338.40",5/14/2019,CALIFORNIA BURRITO
1,CLAUDIO CALONA,30597.0,WELLS FARGO BANK,"$1,138.19",$17.64,"$1,120.55",5/14/2019,STONE TILE EVOLUTION LLC
2,ENRIQUE OROSCO DIAZ,3064.0,EL DORADO SAVINGS BANK,$895.34,$13.88,$881.46,5/14/2019,SB MARTIN LLC
3,CESAR ORTIZ RANGEL,10101647.0,CALIFORNIA BANK,$356.34,$5.52,$350.82,5/14/2019,HORIZON
4,CESAR ORTIZ RANGEL,10094421.0,CALIFORNIA BANK,$607.95,$9.42,$598.53,5/15/2019,HORIZON

In [39]:
str(checks_updated.check_no)

'0        1.068000e+03\n1        3.059700e+04\n2        3.064000e+03\n3        1.010165e+07\n4        1.009442e+07\n             ...     \n14361    2.581330e+05\n14362    1.031588e+09\n14363    1.031570e+09\n14364    5.554700e+04\n14365    3.001287e+08\nName: check_no, Length: 14365, dtype: float64'

In [90]:
dat =[str(x) for x in checks_updated.check_no]
dat[1:4]

['305970', '30640', '101016470']

In [41]:
checks_updated.loc[:,'check_no'] = [str(x) for x in checks_updated.check_no]

/var/folders/1h/rcqg0k810sz71dr55k5_lztm0000gn/T/ipykernel_33698/2317593942.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  checks_updated.loc[:,'check_no'] = [str(x) for x in checks_updated.check_no]

In [42]:
checks_updated.check_no

0              1068.0
1             30597.0
2              3064.0
3          10101647.0
4          10094421.0
             ...
14361        258133.0
14362    1031588363.0
14363    1031570009.0
14364         55547.0
14365     300128739.0
Name: check_no, Length: 14365, dtype: object

In [43]:
checks_updated['check_no'].loc[:0].values

array(['1068.0'], dtype=object)

Now need to remove the .0 from each of the check number values

In [52]:
checks_updated['check_no'].str.replace('.', '')[0]

/var/folders/1h/rcqg0k810sz71dr55k5_lztm0000gn/T/ipykernel_33698/211850763.py:1: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  checks_updated['check_no'].str.replace('.', '')[0]

'10680'

In [57]:
# checks_updated['check_no'].str.replace('.0','')
# running this will remove all of the 0's don't want to do this 
checks_updated.loc[:,'check_no'] = checks_updated['check_no'].str.replace('.','')

/var/folders/1h/rcqg0k810sz71dr55k5_lztm0000gn/T/ipykernel_33698/124791407.py:3: FutureWarning: The default value of regex will change from True to False in a future version. In addition, single character regular expressions will *not* be treated as literal strings when regex=True.
  checks_updated.loc[:,'check_no'] = checks_updated['check_no'].str.replace('.','')
/var/folders/1h/rcqg0k810sz71dr55k5_lztm0000gn/T/ipykernel_33698/124791407.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  checks_updated.loc[:,'check_no'] = checks_updated['check_no'].str.replace('.','')

In [59]:
checks_updated.check_no.iloc[:4]

0        10680
1       305970
2        30640
3    101016470
Name: check_no, dtype: object

In [60]:
checks_updated.head()

,client_name,check_no,bank,amount,commision,total,date_cashed,company_name
0,DANIEL E AGUIRRE,10680,UNION BANK,"$1,359.47",$21.07,"$1,338.40",5/14/2019,CALIFORNIA BURRITO
1,CLAUDIO CALONA,305970,WELLS FARGO BANK,"$1,138.19",$17.64,"$1,120.55",5/14/2019,STONE TILE EVOLUTION LLC
2,ENRIQUE OROSCO DIAZ,30640,EL DORADO SAVINGS BANK,$895.34,$13.88,$881.46,5/14/2019,SB MARTIN LLC
3,CESAR ORTIZ RANGEL,101016470,CALIFORNIA BANK,$356.34,$5.52,$350.82,5/14/2019,HORIZON
4,CESAR ORTIZ RANGEL,100944210,CALIFORNIA BANK,$607.95,$9.42,$598.53,5/15/2019,HORIZON

Sanity check- check_no is in the correct format before creating unique id

In [61]:
#checks_updated['check_no'] = str(checks_updated.check_no)
checks_updated['unique_id']= checks_updated.check_no + '_'+ checks_updated.bank+ '_' +checks_updated.company_name

/var/folders/1h/rcqg0k810sz71dr55k5_lztm0000gn/T/ipykernel_33698/3792601106.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  checks_updated['unique_id']= checks_updated.check_no + '_'+ checks_updated.bank+ '_' +checks_updated.company_name

In [62]:
checks_updated.head()

,client_name,check_no,bank,amount,commision,total,date_cashed,company_name,unique_id
0,DANIEL E AGUIRRE,10680,UNION BANK,"$1,359.47",$21.07,"$1,338.40",5/14/2019,CALIFORNIA BURRITO,10680_UNION BANK_CALIFORNIA BURRITO
1,CLAUDIO CALONA,305970,WELLS FARGO BANK,"$1,138.19",$17.64,"$1,120.55",5/14/2019,STONE TILE EVOLUTION LLC,305970_WELLS FARGO BANK_STONE TILE EVOLUTION LLC
2,ENRIQUE OROSCO DIAZ,30640,EL DORADO SAVINGS BANK,$895.34,$13.88,$881.46,5/14/2019,SB MARTIN LLC,30640_EL DORADO SAVINGS BANK_SB MARTIN LLC
3,CESAR ORTIZ RANGEL,101016470,CALIFORNIA BANK,$356.34,$5.52,$350.82,5/14/2019,HORIZON,101016470_CALIFORNIA BANK_HORIZON
4,CESAR ORTIZ RANGEL,100944210,CALIFORNIA BANK,$607.95,$9.42,$598.53,5/15/2019,HORIZON,100944210_CALIFORNIA BANK_HORIZON

In [63]:
checks_updated['unique_id'].iloc[:4]

0                 10680_UNION BANK_CALIFORNIA BURRITO
1    305970_WELLS FARGO BANK_STONE TILE EVOLUTION LLC
2          30640_EL DORADO SAVINGS BANK_SB MARTIN LLC
3                   101016470_CALIFORNIA BANK_HORIZON
Name: unique_id, dtype: object

In [64]:
checks_updated.describe()
# put () after

,client_name,check_no,bank,amount,commision,total,date_cashed,company_name,unique_id
count,14365,14365,14365,14365,14365,14365,14365,14364,14364
unique,2077,12578,144,9729,3295,9957,906,1634,14229
top,RAMON DEL CID,640,BANK OF AMERICA,$100.00,$18.00,$982.00,11/5/2021,J & E FONSECA TACOS INC,13400_UNION BANK_CALIFORNIA BURRITO
freq,500,10,3888,120,70,65,74,1007,3

In [65]:
checks_updated.tail()

,client_name,check_no,bank,amount,commision,total,date_cashed,company_name,unique_id
14361,JUAN SARABIA,2581330,BANK OF AMERICA,$671.95,$12.10,$659.85,11/09/2021,SAMUEL HALE LLC,2581330_BANK OF AMERICA_SAMUEL HALE LLC
14362,ELDER CHOCOJ,10315883630,CHASE BANK,"$1,021.07",$18.38,"$1,002.69",11/09/2021,FOUNTAINS GYRO HOUSE LLC,10315883630_CHASE BANK_FOUNTAINS GYRO HOUSE LLC
14363,ELDER CHOCOJ,10315700090,CHASE BANK,"$1,540.02",$27.72,"$1,512.30",11/09/2021,RIDGE GYRO HOUSE,10315700090_CHASE BANK_RIDGE GYRO HOUSE
14364,LEONORA OCHOA RUIZ,555470,PREMIER BANK,"$1,283.56",$23.10,"$1,260.46",11/09/2021,TWS RESTAURANT CORP STORE,555470_PREMIER BANK_TWS RESTAURANT CORP STORE
14365,VICTOR VALADEZ,3001287390,US BANK,$754.76,$13.59,$741.17,11/09/2021,AVITUS INC,3001287390_US BANK_AVITUS INC

In [66]:
checks_updated['unique_id'].values

array(['10680_UNION BANK_CALIFORNIA BURRITO',
       '305970_WELLS FARGO BANK_STONE TILE EVOLUTION LLC',
       '30640_EL DORADO SAVINGS BANK_SB MARTIN LLC', ...,
       '10315700090_CHASE BANK_RIDGE GYRO HOUSE',
       '555470_PREMIER BANK_TWS RESTAURANT CORP STORE',
       '3001287390_US BANK_AVITUS INC'], dtype=object)

In [67]:
checks_df.isna().any()

client_name      True
check_no         True
bank             True
amount           True
commision       False
total           False
date_cashed      True
company_name     True
dtype: bool

In [68]:
# drop missing values went from 17,900 to 14,300 entries 
# sanity check
checks_updated.isna().any()

client_name     False
check_no        False
bank            False
amount          False
commision       False
total           False
date_cashed     False
company_name     True
unique_id        True
dtype: bool

In [78]:
checks_updated['unique_id'].loc[:3].values

array(['10680_UNION BANK_CALIFORNIA BURRITO',
       '305970_WELLS FARGO BANK_STONE TILE EVOLUTION LLC',
       '30640_EL DORADO SAVINGS BANK_SB MARTIN LLC',
       '101016470_CALIFORNIA BANK_HORIZON'], dtype=object)

In [79]:
# should i take the _ out? 
checks_updated['unique_id'].str.replace('_','')

0                     10680UNION BANKCALIFORNIA BURRITO
1        305970WELLS FARGO BANKSTONE TILE EVOLUTION LLC
2              30640EL DORADO SAVINGS BANKSB MARTIN LLC
3                       101016470CALIFORNIA BANKHORIZON
4                       100944210CALIFORNIA BANKHORIZON
                              ...
14361             2581330BANK OF AMERICASAMUEL HALE LLC
14362     10315883630CHASE BANKFOUNTAINS GYRO HOUSE LLC
14363             10315700090CHASE BANKRIDGE GYRO HOUSE
14364       555470PREMIER BANKTWS RESTAURANT CORP STORE
14365                       3001287390US BANKAVITUS INC
Name: unique_id, Length: 14365, dtype: object

In [80]:
checks_updated['check_no'].loc[:3].values

array(['10680', '305970', '30640', '101016470'], dtype=object)

In [81]:
#checks_updated['check_no'].str.replace('\n','').str.replace('\\n1','')[0]
#checks_updated['check_no'].str.split().str.join("")[0]

In [82]:
checks_updated.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14365 entries, 0 to 14365
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   client_name   14365 non-null  object
 1   check_no      14365 non-null  object
 2   bank          14365 non-null  object
 3   amount        14365 non-null  object
 4   commision     14365 non-null  object
 5   total         14365 non-null  object
 6   date_cashed   14365 non-null  object
 7   company_name  14364 non-null  object
 8   unique_id     14364 non-null  object
dtypes: object(9)
memory usage: 1.6+ MB

In [83]:
checks_updated['check_no'].loc[:0].values

array(['10680'], dtype=object)

In [47]:
# need to bring the data into the right shape 
# unique id- index column 
# ds column has the date or a numerical value 
# y column- the target variable of our univariate time series

In [52]:
#!pip install statsforecast
#!pip install datasetsforecast

In [3]:
#!pip install s3fs

In [53]:
from statsforecast import StatsForecast

In [ ]:
from statsforecast.models import (
AutoARIMA,
HotWinters,
CrostonClassic as Croston,
HistoricAverage,
DynamicOptimizedTheta as DOT,
SeasonalNaive)

# creating a list of models and instantiation parameters
models = [
    AutoARIMA(season_length=24),
    HotWinters(),
    Croston(),
    HistoricAverage(),
    DOT(season_length=24),
    SeasonalNaive(season_length=24)
]